setup/load_testing/reports/8085-reactive-quarkus-mysql-novt/8085_reactive-quarkus-mysql-novt.txt
errors.ETIMEDOUT: .............................................................. 6
http.codes.200: ................................................................ 66466
http.codes.204: ................................................................ 586
http.codes.404: ................................................................ 21441
http.codes.500: ................................................................ 1
http.downloaded_bytes: ......................................................... 154191768
http.request_rate: ............................................................. 181/sec
http.requests: ................................................................. 88500
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 815
  mean: ........................................................................ 3.9
  median: ...................................................................... 1
  p95: ......................................................................... 8.9
  p99: ......................................................................... 18
http.responses: ................................................................ 88494
vusers.completed: .............................................................. 88494
vusers.created: ................................................................ 88500
vusers.created_by_name.Delete a movie by id: ................................... 893
vusers.created_by_name.Get movies by id: ....................................... 61954
vusers.created_by_name.Get movies by page: ..................................... 17636
vusers.created_by_name.Save new movie: ......................................... 8017
vusers.failed: ................................................................. 6
vusers.session_length:
  min: ......................................................................... 0.9
  max: ......................................................................... 815.8
  mean: ........................................................................ 5.2
  median: ...................................................................... 2.2
  p95: ......................................................................... 10.3
  p99: ......................................................................... 19.5